Autodesk.Revit.DB.LogicalOrFilter.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementFilter})
Constructs a new instance of the logical filter with any number of input filters.
filters:
A collection of input filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The filter collection is empty, or contains invalid inputs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.LogicalOrFilter.#ctor(Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.ElementFilter)
Constructs a new instance of the logical filter with two input filters.
filter1:
The first filter.
filter2:
The second filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011